{"class_name": "BinaryDenseNet", "config": {"name": "binary_densenet37", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_77", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_77", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_77", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_9", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_78", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_78", "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_60", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_60", "inbound_nodes": [[["batch_normalization_78", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_23", "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}], ["quant_conv2d_60", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_79", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_79", "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_61", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_61", "inbound_nodes": [[["batch_normalization_79", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_24", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_24", "inbound_nodes": [[["concatenate_23", 0, 0, {}], ["quant_conv2d_61", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_80", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_80", "inbound_nodes": [[["concatenate_24", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_62", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_62", "inbound_nodes": [[["batch_normalization_80", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_25", "inbound_nodes": [[["concatenate_24", 0, 0, {}], ["quant_conv2d_62", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_81", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_81", "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_63", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_63", "inbound_nodes": [[["batch_normalization_81", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_26", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_26", "inbound_nodes": [[["concatenate_25", 0, 0, {}], ["quant_conv2d_63", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_82", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_82", "inbound_nodes": [[["concatenate_26", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_64", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_64", "inbound_nodes": [[["batch_normalization_82", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_27", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_27", "inbound_nodes": [[["concatenate_26", 0, 0, {}], ["quant_conv2d_64", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_83", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_83", "inbound_nodes": [[["concatenate_27", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_65", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_65", "inbound_nodes": [[["batch_normalization_83", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_28", "inbound_nodes": [[["concatenate_27", 0, 0, {}], ["quant_conv2d_65", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_84", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_84", "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_10", "inbound_nodes": [[["batch_normalization_84", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_85", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_85", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_66", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_66", "inbound_nodes": [[["batch_normalization_85", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_29", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["quant_conv2d_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_86", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_86", "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_67", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_67", "inbound_nodes": [[["batch_normalization_86", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_30", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_30", "inbound_nodes": [[["concatenate_29", 0, 0, {}], ["quant_conv2d_67", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_87", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_87", "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_68", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_68", "inbound_nodes": [[["batch_normalization_87", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_31", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_31", "inbound_nodes": [[["concatenate_30", 0, 0, {}], ["quant_conv2d_68", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_88", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_88", "inbound_nodes": [[["concatenate_31", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_69", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_69", "inbound_nodes": [[["batch_normalization_88", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_32", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_32", "inbound_nodes": [[["concatenate_31", 0, 0, {}], ["quant_conv2d_69", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_89", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_89", "inbound_nodes": [[["concatenate_32", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_70", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_70", "inbound_nodes": [[["batch_normalization_89", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_33", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_33", "inbound_nodes": [[["concatenate_32", 0, 0, {}], ["quant_conv2d_70", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_90", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_90", "inbound_nodes": [[["concatenate_33", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_71", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_71", "inbound_nodes": [[["batch_normalization_90", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_34", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_34", "inbound_nodes": [[["concatenate_33", 0, 0, {}], ["quant_conv2d_71", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_91", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_91", "inbound_nodes": [[["concatenate_34", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_72", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_72", "inbound_nodes": [[["batch_normalization_91", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_35", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_35", "inbound_nodes": [[["concatenate_34", 0, 0, {}], ["quant_conv2d_72", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_92", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_92", "inbound_nodes": [[["concatenate_35", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_73", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_73", "inbound_nodes": [[["batch_normalization_92", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_36", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_36", "inbound_nodes": [[["concatenate_35", 0, 0, {}], ["quant_conv2d_73", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_93", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_93", "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_11", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_11", "inbound_nodes": [[["batch_normalization_93", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["max_pooling2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_94", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_94", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_74", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_74", "inbound_nodes": [[["batch_normalization_94", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_37", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_37", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["quant_conv2d_74", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_95", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_95", "inbound_nodes": [[["concatenate_37", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_75", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_75", "inbound_nodes": [[["batch_normalization_95", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_38", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_38", "inbound_nodes": [[["concatenate_37", 0, 0, {}], ["quant_conv2d_75", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_96", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_96", "inbound_nodes": [[["concatenate_38", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_76", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_76", "inbound_nodes": [[["batch_normalization_96", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_39", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_39", "inbound_nodes": [[["concatenate_38", 0, 0, {}], ["quant_conv2d_76", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_97", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_97", "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_77", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_77", "inbound_nodes": [[["batch_normalization_97", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_40", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_40", "inbound_nodes": [[["concatenate_39", 0, 0, {}], ["quant_conv2d_77", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_98", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_98", "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_78", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_78", "inbound_nodes": [[["batch_normalization_98", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_41", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_41", "inbound_nodes": [[["concatenate_40", 0, 0, {}], ["quant_conv2d_78", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_99", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_99", "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_79", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_79", "inbound_nodes": [[["batch_normalization_99", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_42", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_42", "inbound_nodes": [[["concatenate_41", 0, 0, {}], ["quant_conv2d_79", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_100", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_100", "inbound_nodes": [[["concatenate_42", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_80", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_80", "inbound_nodes": [[["batch_normalization_100", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_43", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_43", "inbound_nodes": [[["concatenate_42", 0, 0, {}], ["quant_conv2d_80", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_101", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_101", "inbound_nodes": [[["concatenate_43", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_81", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_81", "inbound_nodes": [[["batch_normalization_101", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_44", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_44", "inbound_nodes": [[["concatenate_43", 0, 0, {}], ["quant_conv2d_81", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_102", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_102", "inbound_nodes": [[["concatenate_44", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_82", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.3}}, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_19", "trainable": true, "dtype": "float32", "clip_value": 1.3}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"name": "ste_sign_20", "trainable": true, "dtype": "float32", "clip_value": 1.3}}}, "name": "quant_conv2d_82", "inbound_nodes": [[["batch_normalization_102", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_45", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_45", "inbound_nodes": [[["concatenate_44", 0, 0, {}], ["quant_conv2d_82", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_103", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_103", "inbound_nodes": [[["concatenate_45", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_83", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 