{"class_name": "Model", "config": {"name": "dorefanet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_9"}, "name": "input_9", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [12, 12], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_25", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_170", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "DoReFaQuantizer", "config": {"name": "do_re_fa_quantizer", "trainable": true, "dtype": "float32", "k_bit": 2}}, "kernel_quantizer": "magnitude_aware_sign_unclipped"}, "name": "quant_conv2d_170", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_204", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_204", "inbound_nodes": [[["quant_conv2d_170", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_22", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_22", "inbound_nodes": [[["batch_normalization_204", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_171", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "DoReFaQuantizer", "config": {"name": "do_re_fa_quantizer", "trainable": true, "dtype": "float32", "k_bit": 2}}, "kernel_quantizer": "magnitude_aware_sign_unclipped"}, "name": "quant_conv2d_171", "inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_205", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_205", "inbound_nodes": [[["quant_conv2d_171", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_23", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_23", "inbound_nodes": [[["batch_normalization_205", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_172", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "DoReFaQuantizer", "config": {"name": "do_re_fa_quantizer", "trainable": true, "dtype": "float32", "k_bit": 2}}, "kernel_quantizer": "magnitude_aware_sign_unclipped"}, "name": "quant_conv2d_172", "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_206", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_206", "inbound_nodes": [[["quant_conv2d_172", 0, 0, {}]]]}, {"class_name": "QuantConv2D", "config": {"name": "quant_conv2d_173", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "pad_values": 0.0, "input_quantizer": {"class_name": "DoReFaQuantizer", "config": {"name": "do_re_fa_quantizer", "trainable": true, "dtype": "float32", "k_bit": 2}}, "kernel_quantizer": "magnitude_aware_sign_unclipped"}, "name": "quant_conv2d_173", "inbound_nodes": [[["batch_normalization_206", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_207", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_207", "inbound_nodes": [[["quant_conv2d_173", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_24", "inbound_nodes": [[["batch_normalization_207", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_8", "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]]}, {"class_name": "QuantDense", "config": {"name": "quant_dense_3", "trainable": true, "dtype": "float32", "units": 4096, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "input_quantizer": {"class_name": "DoReFaQuantizer", "config": {"name": "do_re_fa_quantizer", "trainable": true, "dtype": "float32", "k_bit": 2}}, "kernel_quantizer": "magnitude_aware_sign_unclipped"}, "name": "quant_dense_3", "inbound_nodes": [[["flatten_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_208", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_208", "inbound_nodes": [[["quant_dense_3", 0, 0, {}]]]}, {"class_name": "QuantDense", "config": {"name": "quant_dense_4", "trainable": true, "dtype": "float32", "units": 4096, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "input_quantizer": {"class_name": "DoReFaQuantizer", "config": {"name": "do_re_fa_quantizer", "trainable": true, "dtype": "float32", "k_bit": 2}}, "kernel_quantizer": "magnitude_aware_sign_unclipped"}, "name": "quant_dense_4", "inbound_nodes": [[["batch_normalization_208", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_209", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_209", "inbound_nodes": [[["quant_dense_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "dtype": "float32", "activation": "clip_by_value_activation"}, "name": "activation_32", "inbound_nodes": [[["batch_normalization_209", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_33", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["activation_33", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}